src/test/resources/fetchSuccessRequest.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:soap1="http://soap.integration.fsm.comarch.com/">
   <soap:Header/>
   <soap:Body>
      <soap1:fetchAvailableAppointmentSlots>
         <query>
            <sourceSystem>Tytan</sourceSystem>
            <processId>1111</processId>
            <processCreationDate>20/11/2013</processCreationDate>
            <orderType>intallation</orderType>
            <orderTechnology>HFC</orderTechnology>
            <!--Optional:-->
            <inventory>
               <!--Optional:-->
               <node>
                  <nodeId>21</nodeId>
               </node>
               <!--Optional:-->
               <devices>
                  <!--1 or more repetitions:-->
                  <device>
                     <deviceId>1</deviceId>
                     <deviceName>television</deviceName>
                     <deviceFullName>television</deviceFullName>
                     <!--Optional:-->
                     <serialNumber>111222333444</serialNumber>
                     <!--Optional:-->
                     <macAddress>?aabbbcccddd</macAddress>
                  </device>
               </devices>
                                 </inventory>
            <!--Optional:-->
            <customer>
               <customerId>222</customerId>
               <customerType>34</customerType>
               <!--Optional:-->
               <firstName>mauricio</firstName>
               <!--Optional:-->
               <lastName>camañero</lastName>
               <!--Optional:-->
               <businessName>Tv</businessName>
               <!--Optional:-->
               <phoneNumber1>11122233</phoneNumber1>
               <!--Optional:-->
               <phoneNumber2></phoneNumber2>
               <!--Optional:-->
               <phoneNumber3></phoneNumber3>
               <!--Optional:-->
               <email></email>
               <!--Optional:-->
               <contacts>
                  <!--1 or more repetitions:-->
                  <contact>
                     <name>mc</name>
                     <!--1 or more repetitions:-->
                     <value>mc</value>
                  </contact>
               </contacts>
               <!--Optional:-->
            </customer>
            <interval>
               <dateFrom>11/03/2014</dateFrom>
               <dateTo>11/03/2014</dateTo>
            </interval>
            <!--Optional:-->
         </query>
      </soap1:fetchAvailableAppointmentSlots>
   </soap:Body>
</soap:Envelope>